# HasModifiedGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..HasModifiedGeometry Method
FamilyInstance Class See Also
---
Identifies if the geometry of this FamilyInstance has been modified from the automatically generated default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool HasModifiedGeometry()
```

Visual Basic
---
```text
Public Function HasModifiedGeometry As Boolean
```

Visual C++
---
```text
public:
bool HasModifiedGeometry()
```

# Remarks
This method returns true if the geometry has been modified from post-processing activity in Revit such as joining, cutting, coping, extension, adaptive component modification, or other similar activity.
# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace